import pandas as pd

df = pd.read_csv('final_merged_data/외래 진료과별 상위20 주요상병_f.csv')

pivot = df.pivot_table(
    index='상명코드',
    columns='진료과',
    values='건수',
    aggfunc='sum',
    fill_value=0
)

department_mapping = {
    'DM': '피부과',
    '가정의학과': '가정의학과',
    '감염내과': '내과',
    '감염병전담의학과': '내과',
    '구강내과': '치과',
    '구강악안면외과': '치과',
    '내분비내과': '내과',
    '류마티스내과': '내과',
    '마취통증의학과': '마취통증의학과',
    '방사선종양학과': '방사선종양학과',
    '비뇨의학과': '비뇨의학과',
    '산부인과': '산부인과',
    '생활지원센터': '생활지원센터',
    '성형외과': '성형외과',
    '소아청소년과': '소아청소년과',
    '소화기내과': '내과',
    '소화기 내과': '내과',
    '심장 내과': '내과',
    '수면다원검사과': '수면다원검사과',
    '순환기내과': '내과',
    '신경과': '신경과',
    '신경외과': '신경외과',
    '신장내과': '내과',
    '심장내과': '내과',
    '안과': '안과',
    '암센터': '암센터',
    '영상의학과': '영상의학과',
    '완화의료사업': '호스피스완화의료센터',
    '외과': '외과',
    '욕창성형클리닉': '외과',
    '응급의학과': '응급의학과',
    '이비인후과': '이비인후과',
    '일반검진': '일반검진',
    '일반내과': '내과',
    '입원전담의학과': '입원전담의학과',
    '재택치료진료센터': '재택치료진료센터',
    '재활의학과': '재활의학과',
    '정신건강의학과': '정신건강의학과',
    '정형외과': '정형외과',
    '제작부': '제작부',
    '종합검진': '종합검진',
    '진단검사의학과': '진단검사의학과',
    '진료부장실': '진료부장실',
    '치과': '치과',
    '치과보존과': '치과',
    '치과보철과': '치과',
    '치주과': '치과',
    '통증클리닉': '마취통증의학과',
    '통합치의학과': '치과',
    '피부과': '피부과',
    '한방진료과': '한의과',
    '한의과': '한의과',
    '핵의학과': '핵의학과',
    '혈액종양내과': '내과',
    '호스피스완화의료센터': '호스피스완화의료센터',
    '호흡기·알레르기내과': '내과',
    '호흡기내과': '내과',
    '호흡기 내과': '내과',
    '흉부외과': '흉부외과'
}

# 열 이름 매핑
pivot.columns = [department_mapping.get(col, col) for col in pivot.columns]
# 대표 진료과별로 합산
pivot_merged = pivot.groupby(level=0, axis=1).sum()
pivot_merged = pivot_merged.astype(int)  # 모든 값을 정수로 변환

pivot_merged.to_csv('new_merged_data/상병코드별_진료과_건수_더미_병합.csv')
